blog/2010/04/17/recursive-algorithm-to-learn-the-first-day-/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>算法学习第一天---递归 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>算法学习第一天---递归</h1>
  <p>
:D 今天如昨天计划一样，开始了第一天的算法学习，为了学习算法，我昨天特意把VS 2010下载下来，今天正好就派上用场了。VS2010改善了不少，UI更是好看了许多。
</p>

<p>
今天学了递归，原来递归也这么难。。。真是后悔本科没有用功学习，都搞创业去了。
</p>

<p>
递归最重要的是：把问题规模由n转化为n-1，依此类推，最好得出可求解的部分，这也是退出递归的条件。
</p>

<p>
那么在递归算法上，最常用的两个示例是《汉诺塔》和《排列产生器》
</p>

<ol class="org-ol">
<li>[汉诺塔]
</li>
</ol>
<p>
分析：假定圆盘数目为n。为把最大的圆盘置于塔B的底部，需要将其余的n-1个圆盘移动到塔C，然后将最大的圆盘移动到塔B。现在剩下的的任务是将圆盘从塔C移动到塔B。完成该任务后，塔A和塔B可用。塔B上已经有一个圆盘，但是可以忽略，因为该圆盘是最大的。
那么这个问题就可以转化为两个n-1的问题来解决了。
</p>


<pre class="example">
    enum tower {A='A', B='B', C='C'};
void move(tower x, tower y, tower z, int n)
{
    if(1 == n)
    {
     std::cout &lt;&lt; "Move a disk from " &lt;&lt; char(x) &lt;&lt; " to " &lt;&lt; char(y) &lt;&lt; std::endl;
  }
 else
  {
     move(x, z, y, n-1);
       std::cout &lt;&lt; "Move a disk from " &lt;&lt; char(x) &lt;&lt; " to " &lt;&lt; char(y) &lt;&lt; std::endl;
      move(z, y, x, n-1);
   }
}
</pre>


<ol class="org-ol">
<li>[排列产生器] 给定n（n &gt;=1）个元素的集合，要求输出该集合所有可能的排列。
</li>
</ol>
<p>
分析：例如，该集合为{a, b ,c}，那么排列为{(a, b, c), (a, c, b), (b, a, c), (b, c, a), (c, a, b), (c, b, a)}。可以很容易看出给定n个元素，有 n! 个不同的排列。假设现在有一个4个元素的集合{a, b, c, d}，可能得到一个简单的算法：
(1). a 加上(b, c, d)的所有排列
(2). b 加上(a, c, d)的所有排列
(3). c 加上(a, b, d)的所有排列
(4). d 加上(a, b, c)的所有排列
这就是说，n=4的问题转化为n=3的问题了。。。这就是递归的讯息。
</p>


<pre class="example">
    void Perm(int a[], int k, int n)
{
   if(k == n){
       for(int i =0; i &lt; n; ++i) std::cout &lt;&lt; a[i] &lt;&lt; " ";
        std::cout &lt;&lt; std::endl;
 }
 else
  {
     for(int i = k-1; i &lt;= n-1; ++i)
        {
         int t = a[k-1]; a[k-1] = a[i]; a[i] = t;
          Perm(a, k+1, n);
          t = a[k-1]; a[k-1] = a[i]; a[i] = t;
      }
 }
}
</pre>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
